report/stage_4/profiling/three_nodes/xxh3/wrk2_sharding_xxh3_put.txt
$ wrk2 -c 128 -t 8 -d 125s -R 50000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_sharding_xxh3_put.txt


Running 2m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.328ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.332ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.383ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.389ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.357ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.314ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.421ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37ms    2.09ms 108.74ms   98.24%
    Req/Sec     6.59k   672.57    28.22k    83.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.62ms
 90.000%    2.15ms
 99.000%    4.55ms
 99.900%   34.33ms
 99.990%   67.26ms
 99.999%   94.78ms
100.000%  108.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.026     0.000000            1         1.00
       0.465     0.100000       574732         1.11
       0.661     0.200000      1151886         1.25
       0.827     0.300000      1724696         1.43
       0.985     0.400000      2299962         1.67
       1.145     0.500000      2876380         2.00
       1.227     0.550000      3162986         2.22
       1.312     0.600000      3450276         2.50
       1.403     0.650000      3736305         2.86
       1.503     0.700000      4024628         3.33
       1.615     0.750000      4310279         4.00
       1.678     0.775000      4453374         4.44
       1.749     0.800000      4598800         5.00
       1.827     0.825000      4740804         5.71
       1.917     0.850000      4884628         6.67
       2.023     0.875000      5028728         8.00
       2.083     0.887500      5099725         8.89
       2.151     0.900000      5171501        10.00
       2.229     0.912500      5243974        11.43
       2.321     0.925000      5316347        13.33
       2.431     0.937500      5387380        16.00
       2.497     0.943750      5423074        17.78
       2.575     0.950000      5459602        20.00
       2.665     0.956250      5495234        22.86
       2.777     0.962500      5530672        26.67
       2.921     0.968750      5566567        32.00
       3.011     0.971875      5584717        35.56
       3.115     0.975000      5602676        40.00
       3.239     0.978125      5620606        45.71
       3.395     0.981250      5638393        53.33
       3.619     0.984375      5656423        64.00
       3.779     0.985938      5665382        71.11
       3.995     0.987500      5674347        80.00
       4.295     0.989062      5683273        91.43
       4.791     0.990625      5692290       106.67
       5.755     0.992188      5701216       128.00
       6.571     0.992969      5705715       142.22
       7.671     0.993750      5710194       160.00
       9.103     0.994531      5714697       182.86
      10.959     0.995313      5719180       213.33
      13.295     0.996094      5723676       256.00
      14.703     0.996484      5725905       284.44
      16.303     0.996875      5728149       320.00
      18.143     0.997266      5730394       365.71
      20.367     0.997656      5732638       426.67
      23.359     0.998047      5734888       512.00
      25.119     0.998242      5736010       568.89
      27.007     0.998437      5737132       640.00
      29.087     0.998633      5738254       731.43
      31.567     0.998828      5739382       853.33
      34.719     0.999023      5740495      1024.00
      36.383     0.999121      5741058      1137.78
      38.303     0.999219      5741621      1280.00
      40.511     0.999316      5742186      1462.86
      42.719     0.999414      5742740      1706.67
      45.279     0.999512      5743300      2048.00
      46.783     0.999561      5743585      2275.56
      48.575     0.999609      5743862      2560.00
      50.431     0.999658      5744143      2925.71
      52.607     0.999707      5744422      3413.33
      55.391     0.999756      5744703      4096.00
      57.119     0.999780      5744842      4551.11
      58.879     0.999805      5744982      5120.00
      60.735     0.999829      5745124      5851.43
      62.719     0.999854      5745266      6826.67
      64.895     0.999878      5745405      8192.00
      66.047     0.999890      5745476      9102.22
      67.583     0.999902      5745546     10240.00
      68.799     0.999915      5745613     11702.86
      70.399     0.999927      5745685     13653.33
      72.511     0.999939      5745754     16384.00
      74.175     0.999945      5745791     18204.44
      75.775     0.999951      5745825     20480.00
      77.951     0.999957      5745860     23405.71
      79.039     0.999963      5745894     27306.67
      80.767     0.999969      5745929     32768.00
      81.663     0.999973      5745947     36408.89
      82.431     0.999976      5745964     40960.00
      83.967     0.999979      5745982     46811.43
      86.015     0.999982      5746000     54613.33
      90.943     0.999985      5746017     65536.00
      91.711     0.999986      5746026     72817.78
      92.479     0.999988      5746034     81920.00
      93.567     0.999989      5746043     93622.86
      95.487     0.999991      5746052    109226.67
      98.623     0.999992      5746061    131072.00
     100.415     0.999993      5746065    145635.56
     101.375     0.999994      5746069    163840.00
     102.335     0.999995      5746074    187245.71
     102.655     0.999995      5746078    218453.33
     103.487     0.999996      5746083    262144.00
     104.063     0.999997      5746085    291271.11
     104.703     0.999997      5746087    327680.00
     105.471     0.999997      5746091    374491.43
     105.471     0.999998      5746091    436906.67
     106.239     0.999998      5746094    524288.00
     106.367     0.999998      5746096    582542.22
     106.367     0.999998      5746096    655360.00
     106.431     0.999999      5746097    748982.86
     106.879     0.999999      5746098    873813.33
     106.943     0.999999      5746099   1048576.00
     107.519     0.999999      5746100   1165084.44
     107.519     0.999999      5746100   1310720.00
     107.711     0.999999      5746102   1497965.71
     107.711     0.999999      5746102   1747626.67
     107.711     1.000000      5746102   2097152.00
     107.711     1.000000      5746102   2330168.89
     107.711     1.000000      5746102   2621440.00
     108.287     1.000000      5746103   2995931.43
     108.287     1.000000      5746103   3495253.33
     108.287     1.000000      5746103   4194304.00
     108.287     1.000000      5746103   4660337.78
     108.287     1.000000      5746103   5242880.00
     108.799     1.000000      5746104   5991862.86
     108.799     1.000000      5746104          inf
#[Mean    =        1.374, StdDeviation   =        2.091]
#[Max     =      108.736, Total count    =      5746104]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6248017 requests in 2.08m, 493.28MB read
  Non-2xx or 3xx responses: 3
Requests/sec:  49985.17
Transfer/sec:      3.95MB